Revit 2024 API
BuiltInFailures.EditingFailures.CannotDrawInCurrentView Property
 Can't draw because Work Plane is at a very sharp angle in this view. Go to another view or redefine the Work Plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDrawInCurrentView { get; }
Visual Basic
Public Shared ReadOnly Property CannotDrawInCurrentView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDrawInCurrentView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace